'''გააკეთეთ 2-2 მაგალითი თიოეულ შედარების ოპერატორზე, გვერდზე კომენტარის საშვალებით მიუთითეთ თუ რომელ boolean მნიშვნელობას გამოიტანას, ასევე კომენტარებით ახსენით თუ რა არის boolean'''

# ვიგებ ათია მეტი თუ ხუთი. (პასუხია:true)
print(10 > 5)
# ვიგებ ოცია მეტი თუ ხუთი. (პასუხია:true)
print(20 > 5)

# ვიგებ ათი თუ მეტია ან ტოლია  ხუთზე. (პასუხია:true)
print(10 >= 5)
# ვიგებ ოცია თუ მეტია ან ტოლია  ხუთზე. (პასუხია:true)
print(20 >= 5)

# ვიგებ ათი ნაკლებია თუ არა ხუთზე (პასუხია:false)
print(10 < 5)
# ვიგებ ათი ნაკლებია თუ არა ხუთზე (პასუხია:false)
print(20 < 5)

# ვიგებ ათი თუ ნაკლებია ან ტოლია ხუთზე. (პასუხია:false)
print(10 <= 5)
# ვიგებ ოცი თუ ნაკლებია ან ტოლია ხუთზე. (პასუხია:false)
print(20 <= 5)

# boolean (bool) მონაცემთა ტიპს შესაძლოა ჰქონდეს მხოლოდ ორი შესაძლო მნიშვნელობა. true ან false. როცა პრინტ ინსტრუქციით ვადარებთ ორ რიცხვს, პასუხად boolean (bool) ტიპის პასუხს ვიგებთ