'''მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ ის ცვლადში და გაამრავლეთ ორზე, შემდეგ კი დაუბეჭდეთ წინადადება ფორმატით: 'Your number multiplied by 2 is <number>' სადაც <number>-ის ნაცვლად ჩაწერეთ 2-ზე გამრავლებულ რიცხვს, გამოიყენეთ ხელოვნური მონაცემტა ტიპის შეცვლა, input-იდან მიღებული მნიშვნელობა გარდაქმენით ჯერ integer ტიპად შემდეგ კი string-ად. ახსენით კომენტარებით თუ როგორ შეასრულეთ დავალება'''

# მომხმარებელს ვუბეჭდავ რომ თუ უჭირს გამრავლების ტაბულა, ეს საიტი მისთვისაა და მისი ცოდნის დახვეწაში დაეხმარება
print('Are you having trouble with the multiplication tables? check your knowledge with us')
# ვბეჭდავ თუ როგორ უნდა გამოვიყენოთ ეს ყველაფერი
print('just multiplicate numbers in your mind and then check here')
# მომხმარებელს ვუბეჭდავ მოდი ორზე გამრავლებით დავიწყოთთქო
print('lets start with multiplication on 2')
# მომხმარებელს შემოაქვს რიცხვი რომელიც მას უნდა რომ გავამრავლო ორზე. მე ეს ინფორმაცია გადამყვავს ინტეჯერში და იმისთვის რომ ეს ინფორმაცია არ დავკარგო, ამ ყველაფერს ცვლადში ვინახავ სახელად - number1 
number1 = int(input('please enter a number that you want to multiplicate on 2: '))
# ახლა რიცხვს რომელც მან შემოიტანა ვამრავლებ ორზე და ამ ყველაფერს ახალ ცვლადში ვინახავ სახელად- number2
number2 = number1 * 2 
# მომხმარებელს ვუბეჭდავ საბოლოო პასუხს
print('Your number multiplied by 2 is ' + str(number2))
