'''ჩამოწერეთ თქვენს მიერ შესწავლილი მონაცემტა ტიპის გარდამქმნელი ინსტრუქციები (str(), int(), float()) და ახსენით თუ რას აკეთებს თითოეული მათგანი'''

# str() ინსტრუქცია ყველა მონაცემთა ტიპს აქცევს სტრინგად. ანუ დასაწყისში და დასასრულში ბრჭყალებს უსვავს. ამის შემდეგ ის რიცხვები რომლებიც სტრინგად გარდავქმენით მათემატიკურ მნისვნელობას დაკარგავენ. კომპიუტერი მათ აღიქვავს როგორც მხოლოდ სიმბოლოები. ეს არის str() ინსტრუქციის მაგალითები:
print(str(60))
print(str(60.0))
print(str(60))

# int() ინსტრუქცია სხვა მონაცემთა ტიპებს მთელ რიცხვად აქცევს. სტრინგს ფრჩხილებს მოაშორებს, ხოლო ათწილადს(float-ს ) დაამრგვალებს მაგრამ არა მათემატიკური დამრგვალებით. ეს ინსტრუქცია ათწილადს მხოლოდ წერტილის მარჯვნივ მყოფ რიცხვებს აშორებს. დანარჩენ მთელს ტოვებს. რომც 4.99 ყოფილიყო, მაინც 4 ს დაწერდა. მაგრამ უნდა გავითვალისწინოთ რომ თუ სტრინგში ასოები წერია, ამას რათქმაუნდა ვერ გარდაქმნიდა. ეს არის int() ინსტრუქციის მაგალითები:
print(int(90.0))
print(int(90.5))
print(int('90'))

# float() ინსტრუქციას სხვა მონაცემთა ტიპები ათწილადად გადაჰყავს. მთელ რიცხვებს წერტილს და მერე ნულს უწერს. ხოლო სტრინგს ბრჭყალებს აშორებს,შემდეგ წერტილს უსვავს და მერე ნულს. ხოლო სტრინგში თუ ათწილადი წერია, მას მხოლოდ ბრჭყალებს მოაშორებს. როგორც int() ინსტრუქციის შემთხვევაში, ის ვერ გარდაქნის სტრინგს ათწილადად თუ სტრინგში ასოები წერია და არა რიცხვები. ეს არის float() ინსტრუქციის მაგალითები:
print(float(121))
print(float('122'))
print(float(123))