''' შექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ შედარების ოპერაციათა შედეგებს, შედარების ოპერაციას გვერდზე კომენტარის საშვალებით მიუწერეთ მისი შედეგი (boolean მნიშვნელობა) და ახსენით რა განსხვავებაა ოპერატორსა და ოპერაციას შორის'''

boolean1 = 2 > 2  # False
boolean2 = 2 == 2.0  # True
boolean3 = 2 >= 2  # True
boolean4 = 2 < 2  # False
boolean4 = 2 != 3  #True

#  ოპერატორი არის ისეთი რამ რომელის საშუალებთაც რამე ოპერაციას გავაკეთებთ. მაგალითად and, or და not ოპერატორებია. მაგრამ როცა მათ გამოვიყენებთ და მათი გამოყენებით ერთი მაგალითი გამოვა, (მაგალითად: True and False) აი მთლიანად მაგ მაგალითს  უკვე ოპერაცია ქვია. ოპერატორით იქმნება ოპერაცია. True and False -ს ოპერტორი არ ქვია რადგან მანდ მარტო and კი არ წერია, არამედ and-ის გამოყენებით შევასრულეთ მოქმედება, ამიტომ ეს ოპერააციაა.
