''' 2) შექმენით სია რომელშიც ჩამოწერთ მინიმუმ 10 პროგრამირების ენას, შემდეგ ამ სიაში მყოფი თქვენთვის ყველაზე არასასურველი ენა ჩაანაცვლეთ ახლით. საბოლოოდ კი slicing-ის გამოყენებით გამოიტანეთ სიის ნაწილები:

დადებითი slicing:
პირველიდან 5-ის ჩათვლით
2-დან ბოლომდე
4-დან 8-მდე

უარყოფითი:

მეექსვედან ბოლომდე
მეექვსემდე ყველაფერი
მეექვსეს ჩათვლით თავიდან ყველაფერი

ბონუს:
მთელი სია გამოიტანეთ თავიდან ბოლომდე შემობრუნებულად'''
#       - 10       -9      -8        -7          -6     -5      -4      -3         -2         -1
list =['python', 'java' , 'c++', 'javascript' , 'c#', 'php' , 'ruby', 'swift', 'typescript', 'rust']
#       0           1       2         3           4     5        6       7          8           9

# 1. არასასურველი ენის ჩანაცვლება:
list[7] = 'go'

# 2. სიის ნაწილების გამოტანა:
# 1 - 5
print(list[1:5])
# 2 - ბოლომდე
print(list[2:])   
# 4 - 8
print(list[4:8])
# უარყოფითი slicing:
# 6 - ბოლომდე
print(list[-4:]) 
# 6-მდე ყველაფერი
print(list[:-4]) 
# მეექვსეს ჩათვლით თავიდან ყველაფერი(თუ იგულისხმეთ ყველაფერი ექვსამდე და არა ექვსის შემდეგ)
print(list[:-4])  
# თუ იგულისხმეთ ყველაფერი მეექვსის შემდეგ და არა ის რიცხვები რაც მანამდეა
print(list[-4:])
#თუ იგულისხმეთ მთელი სია ექვსის ჩათვლით
print(list[-10:-1:-1])
# ბონუსი 
# მთელ სიას შემობრუნებულად გამოტანა
print(list[::-1]) 