'''თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.'''

#ვქმნი ხუთ ცვლადს რომლის მნიშვნელობის ტიპიც სტრინგია
str1 = 'Barbare'
str2 = 'Shaverdashvili'
str3 = 'GOA'
str4 = '5'
str5 = 'python'

#ვქმნი ხუთ ცვლადს რომლის მნიშვნელობის ტიპიც ინტეჯერია
int1 = 2024
int2 = 5
int3 = 10
int4 = 10000000
int5 = 15

#ვქმნი ხუთ ცვლადს რომლის მნიშვნელობის ტიპიც float ია
float1 = 5.0
float2 = 5.5
float3 = 10.1
float4 = 50.8
float5 = 20.8

# str1, str2, str3, str4, და str5 ცვლადების მნიშვვნელობა სტრინგია
# int1, int2, int3, int4, და int5 ცვლადების მნიშვვნელობა ინტეჯერია
# float1, float2, float3, float4, და float5 ცვლადების მნიშვვნელობა სტრინგია



