''' აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.'''

# ვქმნი ცვლადს სახელად-string რომლის მნიშვნელობაც სტრინგია
string = '5'
# ვქმნი ცვლადს სახელად-integer და მისი მნიშვნელობა ინტეჯერია
integer = 5
#ვქმნი ცვლადს სახელას-float და მისი მნიშვნელობა floatია
float  = 5.0

#type ინსტრუქციის გამოყენებით ვამოწმებ თუ რა ტიპისაა ცვლადი-string
print(type(string))
#type ინსტრუქციის გამოყენებით ვამოწმებ თუ რა ტიპისაა ცვლადი-integer
print(type(integer))
#type ინსტრუქციის გამოყენებით ვამოწმებ თუ რა ტიპისაა ცვლადი-float
print(type(float))