'''შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.'''

# მომხმარებელს შემოვატანინე თავისი სახელი და ეს ინფორმაცია შევინახე ცვლადში სახელად-Users_name
Users_name = input('Please enter your name: ')
# მომხმარებელს შემოვატანინე თავისი ასაკი და ეს ინფორმაცია შევინახე ცვლადში სახელად-Users_age
Users_age = input('Please enter your name: ')
# მომხმარებელა შემოვატანინე თავისი სიმაღლე და ეს ინფორმაცია შევინახე ცვლადში სახელად-Users_height
Users_height = input('Please enter your height: ')

# ეხლა გავიგებ თუ რა ტიპის ინფორმაცია ინახება ცვლადში
print(type(Users_name))
# ეხლა გავიგებ თუ რა ტიპის ინფორმაცია ინახება ცვლადში
print(type(Users_age))
# ეხლა გავიგებ თუ რა ტიპის ინფორმაცია ინახება ცვლადში
print(type(Users_height))