'''ცვლადების გამოყენებით დაბეჭდეთ თქვენი სახელი და გვარი, შემდეგ დაბეჭდეთ 3 მათემატიკური ოპერაციის (+,-,*) შედეგი და თქვენი ჰობი, ყველაფერი ახსენით კომენტარებით ქართულად და ცვლადებს სახელები დაარქვით snake_case-ის სტილში (გამოიყენეთ სტანდარტები და საუკეთესო პრაქტიკები)'''

#ვქმნი ჩემი სახელის და გვარის ცვლადს
last_name='Shaverdashvili'
first_name='Barbare '

#გამომაქვს ცვლადის მნიშვნელობა ტერმინალში
print(first_name + last_name)

#ვქმნი ცვლადებს სადაც ვინახავ რიცხვებს
num1=2
num2=4

#ახლა შევასრულებ სამ მათემატიკურ ოპერაციას
print (num1+num2)
print (num2-num1)
print (num2*num2)

#ვქმნი ცვლადს სადაც წერია ჩემი ჰობი
my_hobby='drawing'

#ახლა გამოვიტან ცვლადის მნიშვნელობას სადაც ინახება ჩემი ჰობი
print(my_hobby)





























































