'''1) შექმენით სია რომელშიც შეინახავთ თქვენი საყვარელი სპორტსმენების სახელებს. შემდეგ ამ სიაზე გამოიყეენთ მეთოდები: append, insert, pop თითოეული 3-ჯერ. ასევე კომენტარებით დაწერეთ თუ როგორ მუშაობს თითოეული მეთოდი'''
sportsmen = ['Yoichi Isagi', 'Itoshi Rin', 'Meguru Bachira', 'Hyoma Chigiri', 'Michael Kaiser', 'Itoshi Sae', 'Yoichi Isagi']
sportsmen.append('Ryusei Shidou')
sportsmen.append('Seishiro Nagi')
sportsmen.append('Gigamaru')# --> .append() მა სიას ბოლოში მიუმატა კიდევ ერთი სპორტსმენი. ამისთვის ცვლადის სახელს რომელიც სიას    ინახავს დოტ ნოტაციით უნდა მივუწეროტ ფუნქხიის სახელი, ფრჩხილები, და ბრჭყალებში ის ელემენტი რაც გვინდა რომ მიემატოს. ეს ახალი      ელემენტი სიას ავტომატურად ბოლოში ემატება.
sportsmen.insert(2, 'Kunigami')
sportsmen.insert(4, 'Noa') 
sportsmen.insert(0, 'Loki')# --> .insert append -ისგან განსხვავებით დამატებასთან ერთად ასევე საშუალებას გვაძლევს რომ ინდექსი ავურჩიოთ. ბრჩხილებში ვწერთ ჯერ ინდექსს, მძიმეს და ელემენტს. 
sportsmen.pop(5) 
sportsmen.pop(2)
sportsmen.pop(3) # --> .pop მეთოდი საშუალებას გვაძლევს რომ ელემენტი ამოვაგდოდ სიიდან. ბრჩხილებში უბრალოდ უნდა დავწეროთ იმ      ელემენტის ინდექსი, რომლის ამოგდებაც გვინდა.
sportsmen.remove('Kunigami')
sportsmen.remove('Loki')
sportsmen.remove('Noa') # --> ეს მეთოდიც საშუალებას გვაძლევს რომმ სიიდან ელემენტი ამოვაგდოთ. ოღონთ pop- ისგან განსხვავებით მას ფრჩხილებში ელემენტის სახელი უნდა დავუწეროთ. იმ შემთხვევაში თუ სიაში ერთი და იგივე ელემენტი მეორდება, როგორც ჩემს სიაში            yoichi isagi მეორდება, ეს მეთოდი ამოაგდებს პირველს რაც შეხვდება. ხოლო ბოლო დარჩება.
