'''შექმენით მინიმუმ 5 ცვლადი, რომლებშიც შეინახავთ თქვენი ოჯახის წევრების სახელებს (მაგალითად: mother: "Tamo"), შემდეგ კი დაბეჭდავთ ერთ დიდ წინადადებაში (მაგალითად print("my mother is" + " " + mother))'''

# შევქმენი ცვლადი სადაც ვინახავ დედაჩემის სახელს
Mother='Tamuna'
# შევქმენი ცვლადი სადაც ვინახავ მამაჩემის სახელს
Father='malkhazi'
# შევქმენი ცვლადი სადაც ვინახავ ბაბუაჩემის სახელს
Grandpa='Nikolozi'
# შევქმენი ცვლადი სადაც ვინახავ ბებიაჩემის სახელს
Grandma='sofo'
# შევქმენი ცვლადი სადაც ვინახავ დეიდაჩემის სახელს
Aunt='Marina'

# ვპრინტავ დედაჩემის გვარს და ვუმატებ ცვლადს სადაც წერია მისი სახელი
print('My mother is '+Mother)
# ვპრინტავ მამაჩემის გვარს და ვუმატებ ცვლადს სადაც წერია მისი სახელი
print('My father is '+Father)
# ვპრინტავ ბაბუაჩემის გვარს და ვუმატებ ცვლადს სადაც წერია მისი სახელი
print('My grandpa is '+Grandpa)
# ვპრინტავ ბებიაჩემის გვარს და ვუმატებ ცვლადს სადაც წერია მისი სახელი
print('My grandma is '+Grandma)
# ვპრინტავ დეიდაჩემის გვარს და ვუმატებ ცვლადს სადაც წერია მისი სახელი
print('My aunt is '+Aunt)
