'''თქვენი სასურველ რიცხვებს შორის შეასრულეთ და დაბეჭდეთ ოპერაციები, მინიმუმ 5 თითოეულ ოპერატორზე (+,-,*,//)'''
# პრინტით ვბეჭდავ ხუთის და ხუთის ჯამს
print(5 + 5)
# პრინტით ვბეჭდავ ექვსის და ექვსის ჯამს
print(6 + 6)
# პრინტით ვბეჭდავ შვიდის და შვიდის ჯამს
print(7 + 7)
# პრინტით ვბეჭდავ რვის და რვის ჯამს
print(8 + 8)
# პრინტით ვბეჭდავ ცხრის და ცხრის ჯამს
print(9 + 9)

# პრინტით ვბეჭდავ ხუთის და ხუთის სხვაობას
print(5 - 5)
# პრინტით ვბეჭდავ თორმეტი და ექვსის სხვაობას
print(12 - 6)
# პრინტით ვბეჭდავ ოცის და ხუთის ათის
print(20 - 10)
# პრინტით ვბეჭდავ ორმოცდაათის და ოცდაათის სხვაობას
print(50 - 30)
# პრინტით ვბეჭდავ ორას ოთხმოცდასამი მილიონ ოთხას ორმოცდათექვსმეტი ათას შვიდას ოცდათხუთმეტის და ოთხმოცდაცამეტი მილიონ ოთხას ორმოცდათექვსმეტი ათას შვიდას ოცდათხუთმეტის სხვაობას
print(283456735 - 83456735)

# პრინტით ვბეჭდავ ორის და ორის ნამრავლს
print(2 * 2)
# პრინტით ვბეჭდავ შვიდის და რვისა ნამრავლს
print(7 * 8)
# პრინტით ვბეჭდავ რვის და ექვსის ნამრავლს
print(8 * 6)
# პრინტით ვბეჭდავ ცხრის და ექვსის ნამრავლს
print(9 * 6)
# პრინტით ვბეჭდავ ხუთის და ხუთის ნამრავლს
print(5 * 5)

# პრინტით ვბეჭდავ ორის და ორის განაყოფს
print(2 // 2)
# პრინტით ვბეჭდავ სამოცის და ორის განაყოფს
print(60 // 2)
# პრინტით ვბეჭდავ ორმოცდაათის და ოცდახუთის განაყოფს
print(50 // 25)
# პრინტით ვბეჭდავ ოთხი ათას ხუთას ორმოცდათორმეტის და ორის განაყოფს
print(4572 // 2)
# პრინტით ვბეჭდავ ოცდაათის და თხუთმეტის განაყოფს
print(30 // 15)