'''3) შექმენით პროგრამა, რომელშიც მომხმარებელს შეეკითხებით და input-ის გამოყენებით შემოატანინებთ სახელსა და ასაკს, შემდეგ კი დაბეჭდავთ მათ მონაცემთა ტიპებს'''
# მომხმარეელს უნდა შემოვატანინო მისი სახელი და საკაი
name=input('please enter your name: ')
age = input('please enter your age: ')
#ახლა გავიგებ იმ მონაცემის ტიპს რომელიც მან შემოიტანა
print(type(name))
print(type(age))
# მიუხედავად იმისა რომ მომხმარებლის მიერ შემოტანილი ინფორმაციიდან ერთი რიცხვიერი იყო და მეორე სიტყვიერი,ტერმინალში თაიფით გავიგეთ რომ კომპიუტერმა ორივე სტრინგად აღიქვა

