'''1) შექმენით პროგრამა რომელიც temp ცვლადში ინახავს ტემპერატურას (integer, რიცხვით მნიშვნელობას), ხოლო cloudy ცვლადში boolean (True/False) მნიშვენლობას, პროგრამამ უნდა დაადგინოს walk ცვლადის მნიშვენლობა შემდეგი პირობებიდან გამომდინარე, თუ ტემპერატურა მეტია 20 გრადუს ცელსიუზე და ამინი არ არის ღრუბლიანი მხოლოდ მაშინ უნდა გახდეს walk ცვლადის მნიშვნელობა ჭეშმარიტი'''

temp = 30   # შევქმენი temp ცვლადი სადაც ინახება ტემპერატურა. 
cloudy = False   # შევქმენი cloudy ცვლადი სადაც ინახება boolean მნიშვნელობა
walk = (temp > 20) and cloudy  # შევქმენი ცვლადი walk რომლის მნიშვნელობაცაა cloudy ცვლადის და temp ცვლადი შედარებული ოცის  and ოპერაციის შედეგი.
print(walk)   # ვბეჭდავ walk ცვლადს